app/controllers/authentication_controller.rb

  def login
    @user = User.find_by_name(login_params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "gregre"], ["LIMIT", 1]]