app/controllers/comments_controller.rb

  def index
    @recipe = Recipe.find(params[:recipe_id])
    @comments = Comment.where(recipe_id: @recipe.id)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 18]]

  def create
    @recipe = Recipe.find(params[:recipe_id])
    @comment = @recipe.comments.new(comment_params)

    if @comment.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
INSERT INTO "comments" ("recipe_id", "user_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 26], ["user_id", 1], ["comment", "butts"], ["created_at", "2020-04-09 23:28:33.663881"], ["updated_at", "2020-04-09 23:28:33.663881"]]