app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "tag", "catagories", "ingredient", "how_to_make", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "image" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["image", "https://www.baycare.net/media/3906/istock-1131185755.jpg"], ["updated_at", "2020-04-07 20:21:13.021493"], ["id", 1]]